dev/api-testing/fastapi_bench.txt
Running 10s test @ http://localhost:8001/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.06ms    3.32ms  73.55ms   82.54%
    Req/Sec     1.39k   106.63     1.56k    87.50%
  55558 requests in 10.02s, 7.58MB read
Requests/sec:   5546.34
Transfer/sec:    774.54KB