dev/api-testing/gin_bench.txt
Running 10s test @ http://localhost:8002/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.87ms  680.13us  12.72ms   80.40%
    Req/Sec    13.53k     1.11k   23.04k    78.61%
  540984 requests in 10.10s, 72.75MB read
Requests/sec:  53562.08
Transfer/sec:      7.20MB