dev/api-testing/gin_bench.txt
Running 10s test @ http://localhost:8002/ping
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.89ms  648.08us   9.36ms   78.63%
    Req/Sec    13.36k     1.04k   15.86k    70.50%
  531936 requests in 10.00s, 71.53MB read
Requests/sec:  53186.81
Transfer/sec:      7.15MB